# pandas

In [1]:
import pandas as pd
pd.__version__

'0.25.1'

In [2]:
lis=[1,2,3,4,5,'data value']

In [3]:
lis

[1, 2, 3, 4, 5, 'data value']

In [4]:
s = pd.Series(lis)
s

0             1
1             2
2             3
3             4
4             5
5    data value
dtype: object

In [5]:
type(s)

pandas.core.series.Series

In [6]:
s2=pd.Series([1,2,3,4])

In [7]:
s2

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
empty_s=pd.Series([])

In [9]:
empty_s

Series([], dtype: float64)

In [10]:
s2=pd.Series([1,2,3,4],index=['a','b','c','d'],dtype =float,name='data value')
s2

a    1.0
b    2.0
c    3.0
d    4.0
Name: data value, dtype: float64

In [11]:
sc=pd.Series(0.5)

In [12]:
sc

0    0.5
dtype: float64

In [13]:
sc=pd.Series(0.5,index=[1,2,3])

In [14]:
sc

1    0.5
2    0.5
3    0.5
dtype: float64

In [15]:
dic=pd.Series({'a':112,'b':45})

In [16]:
dic

a    112
b     45
dtype: int64

In [17]:
sw=pd.Series([1,2,3,4,5,6])

In [18]:
sw

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [19]:
sw[0:3]

0    1
1    2
2    3
dtype: int64

In [20]:
sw[0:5]

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [21]:
c=pd.DataFrame(lis,sw)

In [22]:
c

            0
1           1
2           2
3           3
4           4
5           5
6  data value

In [23]:
lin=([12,3,4,5,6,],[12,34,5,6,7],[2,3,5,6,7])
lin

([12, 3, 4, 5, 6], [12, 34, 5, 6, 7], [2, 3, 5, 6, 7])

In [24]:
wm=pd.DataFrame(lin)

In [25]:
wm

    0   1  2  3  4
0  12   3  4  5  6
1  12  34  5  6  7
2   2   3  5  6  7

In [27]:
dic={'ed0':[23,4,5,6,6,4]}

In [28]:
dic

{'ed0': [23, 4, 5, 6, 6, 4]}

In [30]:
d=pd.DataFrame(dic)

In [31]:
d

   ed0
0   23
1    4
2    5
3    6
4    6
5    4

In [38]:
d=[{'q':23,'f':23},{'er':24,'et':12}]

In [39]:
hg=pd.DataFrame(d)

In [40]:
hg

      q     f    er    et
0  23.0  23.0   NaN   NaN
1   NaN   NaN  24.0  12.0

In [45]:
bh={'id':pd.Series([1,2,3,5]),'sn':pd.Series([112,344,676])}

In [46]:
po=pd.DataFrame(bh)

In [47]:
po

   id     sn
0   1  112.0
1   2  344.0
2   3  676.0
3   5    NaN